"""
季度更新数据流程：
    1）下载k线数据（代码列表来源于baoStock）
        1）update
        2）new_stock
    2.1）更新K线数据（代码列表来源于baoStock）
    2.2）更新SW行业个股表（基于日K数据，无需清洗）
    3）下载、清洗更新财务、分红等数据（代码列表来源于行业分类表）
"""


"""
库存周期指标变动定义：
    1）趋势：连续4个季度同增同向变动；
    2）大幅：同增变动超30%；
    3）震荡：同增波动5%以内；
    4）负债率：
        1）环比变动；
        2）震荡波动率控制1%。

大宗商品
{'钢铁': "一级行业", '煤炭': "一级行业", '石油石化': "一级行业", '有色金属': "一级行业",
'农化制品': "二级行业", '化学纤维': "二级行业", '化学原料': "二级行业", '塑料': "二级行业", '造纸': "二级行业"}
农林牧渔
{'动物保健': "二级行业", '林业': "二级行业", '农产品加工': "二级行业", '饲料': "二级行业", '养殖业': "二级行业", '渔业': "二级行业", '种植业': "二级行业", '橡胶': "二级行业"}
地产基建
{'房地产开发': "二级行业", '房屋建设': "二级行业", '工程咨询服务': "二级行业", '基础建设': "二级行业", '专业工程': "二级行业", '玻璃玻纤': "二级行业", '水泥': "二级行业", '装修建材': "二级行业",
'装修装饰': "二级行业", '照明设备': "二级行业", '厨卫电器': "二级行业", '白色家电': "二级行业", '黑色家电': "二级行业", '家居用品': "二级行业", '房地产服务': "二级行业"}
电子
{'光学光电子': "二级行业", '其他电子': "二级行业", '消费电子': "二级行业", '元件': "二级行业"}
半导体
{'电子化学品': "二级行业", '半导体材料': "三级行业", '半导体设备': "三级行业", '分立器件': "三级行业", '集成电路制造': "三级行业", '集成电路封测': "三级行业", 
'模拟芯片设计': "三级行业", '数字芯片设计': "三级行业"}
机械设备
{'工程机械': "二级行业", '轨交设备': "二级行业", '机床工具': "三级行业", '金属制品': "三级行业", '磨具磨料': "三级行业", '其他通用设备': "三级行业", '仪器仪表': "三级行业",
'制冷空调设备': "三级行业", '专用设备': "二级行业", '自动化设备': "二级行业"}
新能源-风光储
{'风电零部件': "三级行业", '风电整机': "三级行业", '光伏电池组件': "三级行业", '光伏辅材': "三级行业", '光伏加工设备': "三级行业", '硅料硅片': "三级行业",
'逆变器': "三级行业", '风力发电': "三级行业", '光伏发电': "三级行业"}
新能源-电池电机
{'电池化学品': "三级行业", '锂电池': "三级行业", '锂电专用设备': "三级行业", '蓄电池及其他电池': "三级行业", '电机': "二级行业"}
电网设备
{'电工仪器仪表': "三级行业", '电网自动化设备': "三级行业", '配电设备': "三级行业", '输变电设备': "三级行业", '线缆部件及其他': "三级行业", '其他电源设备': "二级行业"}
通信
{'电信运营商': "三级行业", '通信工程及服务': "三级行业", '通信应用增值服务': "三级行业", '其他通信设备': "三级行业", '通信网络设备及器件': "三级行业",
                '通信线缆及配套': "三级行业", '通信终端及配件': "三级行业"}
汽车
{'乘用车': "二级行业", '汽车服务': "二级行业", '汽车零部件': "二级行业", '商用车': "二级行业", '摩托车及其他': "二级行业"}
生物医药
{'化学制药': "二级行业", '生物制品': "二级行业", '医疗服务': "二级行业", '医疗器械': "二级行业", '医药商业': "二级行业", '中药': "二级行业"}
食品饮料
{'白酒': "二级行业", '非白酒': "二级行业", '调味发酵品': "二级行业", '食品加工': "二级行业", '休闲食品': "二级行业", '乳品': "三级行业", '软饮料': "三级行业"}
交通运输
{'航空机场': "二级行业", '航运港口': "二级行业", '铁路公路': "二级行业", '物流': "二级行业"}
娱乐消费
{'影视院线': "二级行业", '游戏': "二级行业", '酒店餐饮': "二级行业", '旅游及景区': "二级行业", '商贸零售': "一级行业"}
可选耐用品
{'小家电': "二级行业", '纺织制造': "二级行业", '服装家纺': "二级行业", '饰品': "二级行业", '文娱用品': "二级行业"}
其他消费
{'个护用品': "二级行业", '化妆品': "二级行业", '医疗美容': "二级行业", '教育': "二级行业"}
公用事业
{'电力': "二级行业", '燃气': "二级行业", '环保设备': "二级行业", '环境治理': "二级行业"}
"""

"""
一级行业（目的：还原经济大致运行情况；
          要求：全覆盖，除综合；
          分类：一、二、三产）
第一产业
    {'有色金属': "一级行业", '农林牧渔': "一级行业", '煤炭': "一级行业"}
第二产业
    {'医药生物': "一级行业", '机械设备': "一级行业", '电子': "一级行业", '基础化工': "一级行业", '电力设备': "一级行业", '汽车': "一级行业", '建筑装饰': "一级行业", '公用事业': "一级行业",
    '轻工制造': "一级行业", '食品饮料': "一级行业", '环保': "一级行业", '纺织服饰': "一级行业", '国防军工': "一级行业", '家用电器': "一级行业", '建筑材料': "一级行业", '石油石化': "一级行业",
    '钢铁': "一级行业"}
第三产业
    {'计算机': "一级行业", '传媒': "一级行业", '交通运输': "一级行业", '非银金融': "一级行业", '社会服务': "一级行业", '通信': "一级行业", '商贸零售': "一级行业", '美容护理': "一级行业"}


周期行业（目的：紧密跟踪部分具备指标性意义的行业；
          要求：有代表性；
          分类：周期
          要点：经营净利率等价格因素是核心指标，价在量先，下游需求不佳后，上游往往会先行通过降价刺激下游补库）
    领先周期
        {'工程机械': "二级行业", '大宗用纸': "三级行业", '汽车零部件': "二级行业"}
    大宗周期
        {'煤炭开采': "二级行业", '普钢': "二级行业", '冶钢原料': "二级行业", '工业金属': "二级行业", '小金属': "二级行业", '炼化及贸易': "二级行业"}
    其他周期
        {'水泥': "二级行业", '住宅开发': "三级行业", '商业地产': "三级行业", '产业地产': "三级行业", '装修建材': "二级行业", '厨卫电器': "二级行业"}
        {'生猪养殖': "三级行业", '肉鸡养殖': "三级行业"}
    美林时钟
        复苏：可选消费、通信、科技 --> 可选消费、新兴产业
        过热：科技、工业、原油/天然气 --> 中上游的工业原料、制造，新兴产业
        滞涨：必须消费、金融、可选消费、医药 --> 离不开的商品、服务
        衰退：原油/天然气、医药、公用事业 --> 实在离不开的商品
        可选消费
            {'房地产开发': "二级行业", '家居用品': "二级行业", '服装家纺': "二级行业", '影视院线': "二级行业", '饰品': "二级行业", '酒店餐饮': "二级行业", '旅游及景区': "二级行业",
            '汽车零部件': "二级行业", '乘用车': "二级行业", '休闲食品': "二级行业", '游戏': "二级行业", '家用电器': "一级行业", '装修建材': "二级行业", '商用车': "二级行业", '文娱用品': "二级行业",
            '教育': "二级行业", '白酒': "二级行业", '非白酒': "二级行业", '食品加工': "二级行业", '饮料乳品': "二级行业"}
        必需消费
            {'养殖业': "一级行业", '调味发酵品': "二级行业", '电信运营商': "三级行业", '个护用品': "二级行业", '物业管理': "三级行业"}
        科技
            {'半导体': "二级行业", '电子化学品': "二级行业", '其他电子': "二级行业", '消费电子': "二级行业", '光学光电子': "二级行业", 'IT服务': "二级行业", '软件开发': "二级行业", '计算机设备': "二级行业"}
        医药
            {'化学制药': "二级行业", '生物制品': "二级行业", '医疗服务': "二级行业", '医疗器械': "二级行业", '医药商业': "二级行业", '中药': "二级行业"}
        大宗商品
            {'冶钢原料': "二级行业", '化学纤维': "二级行业", '化学原料': "二级行业", '塑料': "二级行业", '橡胶': "三级行业", '煤炭': "一级行业", '工业金属': "二级行业", '能源金属': "二级行业", '小金属': "二级行业",
            '玻璃玻纤': "二级行业", '水泥': "二级行业", '炼油化工': "三级行业", '其他石化': "三级行业"}
        公用事业
            {'电力': "二级行业", '燃气': "二级行业", '水务及水治理': "三级行业"}
        工业制造
            {'机械设备': "一级行业", '化学制品': "二级行业", '电力设备': "一级行业", '元件': "二级行业", '纺织制造': "二级行业", '普钢': "二级行业", '特钢': "二级行业",
            '通信设备': "二级行业", '环保设备': "二级行业", '农化制品': "一级行业", '包装印刷': "二级行业"}


三级行业（目的：深入跟踪具备发展前景的行业；
          要求：发展潜力大；
          分类：无；）
    {'半导体材料': "三级行业", '半导体设备': "三级行业", '模拟芯片设计': "三级行业", '数字芯片设计': "三级行业", '电子化学品': "三级行业"}
    {'机床工具': "三级行业", '工控设备': "三级行业", '汽车电子电气系统': "三级行业", '其他生物制品': "三级行业", '医疗设备': "三级行业"}

"""
