from quant.factor_service import FactorAnalyzer


# --------------------------------------------
def factor_analysis():
    """单因子分析"""
    analyzer = FactorAnalyzer(
        source_dir="202504M量价",
        factors_name=[
            "市场贝塔_0.25", "市场贝塔_0.5", "市场贝塔_1", "市场贝塔_1.5", "市场贝塔_2",
            "累加收益率_0.25", "累加收益率_0.5", "累加收益率_1", "累加收益率_1.5", "累加收益率_2",
            "真实波幅_0.25", "真实波幅_0.5", "真实波幅_1", "真实波幅_1.5", "真实波幅_2",
            "收盘价均线_0.25", "收盘价均线_0.5", "收盘价均线_1", "收盘价均线_1.5", "收盘价均线_2",
            "成交量均线_0.25", "成交量均线_0.5", "成交量均线_1", "成交量均线_1.5", "成交量均线_2",
            "换手率均线_0.25", "换手率均线_0.5", "换手率均线_1", "换手率均线_1.5", "换手率均线_2",
            "真实波幅均线_0.25", "真实波幅均线_0.5", "真实波幅均线_1", "真实波幅均线_1.5", "真实波幅均线_2",
            "收益率标准差_0.25", "收益率标准差_0.5", "收益率标准差_1", "收益率标准差_1.5", "收益率标准差_2",
            "换手率标准差_0.25", "换手率标准差_0.5", "换手率标准差_1", "换手率标准差_1.5", "换手率标准差_2",
            "真实波幅标准差_0.25", "真实波幅标准差_0.5", "真实波幅标准差_1", "真实波幅标准差_1.5", "真实波幅标准差_2",
            "斜率_0.25", "斜率_0.5", "斜率_1", "斜率_1.5", "斜率_2",
        ],
        cycle="month",
        standardization=True,
        mv_neutral=True,
        industry_neutral=True,
        restructure=False,
        group_nums=10
    )
    # 运存限制，使用单进程
    analyzer.run()


if __name__ == "__main__":
    factor_analysis()
