"""
各种特定的行业分类，以满足不同需求的宏观/中观维度分析
"""

# from enum import Enum
#
#
# #############################################################
# class Industry(Enum):
#     BULK_COMMODITY = '大宗商品'
#     AGRICULTURE = '农业'
#
#
# #############################################################
# class SubIndustry(Enum):
#     # 大宗商品
#     STEEL = '普钢'
#     SPECIAL_STEEL = '特钢'
#     COAL_MINING = '煤炭开采'
#     # 农业
#     FORESTRY = '林业'
#     AGRICULTURAL_PROCESSING = '农产品加工'
#     PLANTING = '种植业'


INDUSTRY_INVENTORY_CYCLE = {
    # '大宗商品': {
    #     '钢铁': 1, '煤炭': 1, '石油石化': 1, '有色金属': 1, '农化制品': 2, '化学纤维': 2, '化学原料': 2, '塑料': 2, '造纸': 2
    # },
    '大宗商品': {
        '普钢': 2, '特钢': 2, '冶钢原料': 2, '煤炭开采': 2, '焦炭': 2, '炼化及贸易': 2, '油服工程': 2, '油气开采': 2,
        '工业金属': 2, '贵金属': 2, '金属新材料': 2, '能源金属': 2, '小金属': 2, '农化制品': 2, '化学纤维': 2, '化学原料': 2, '塑料': 2,
        '造纸': 2, '橡胶': 2
    },

    '农业': {
        '林业': 2, '农产品加工': 2, '种植业': 2
    },
    '养殖': {
        '动物保健': 2, '畜禽饲料': 3, '水产饲料': 3, '养殖业': 2, '渔业': 2
    },

    '地产': {
        '房地产开发': 2, '房屋建设': 2, '房地产服务': 2
    },
    '基建地产链': {
        '玻璃玻纤': 2, '水泥': 2, '装修建材': 2, '装修装饰': 2, '照明设备': 2
    },
    '基建': {
        '工程咨询服务': 2, '基础建设': 2, '专业工程': 2
    },
    '家居家电': {
        '厨卫电器': 2, '白色家电': 2, '黑色家电': 2, '家电零部件': 2, '家居用品': 2, '小家电': 2, '其他家电': 2
    },

    '电子': {
        '光学光电子': 2, '其他电子': 2, '消费电子': 2, '元件': 2
    },
    # '半导体': {
    #     '电子化学品': 2, '半导体材料': 3, '半导体设备': 3, '分立器件': 3, '集成电路制造': 3, '集成电路封测': 3, '模拟芯片设计': 3,
    #     '数字芯片设计': 3
    # },
    '半导体': {
        '电子化学品': 2, '半导体': 2
    },

    # '机械设备': {
    #     '工程机械': 2, '轨交设备': 2, '机床工具': 3, '金属制品': 3, '磨具磨料': 3, '其他通用设备': 3, '仪器仪表': 3,
    #     '制冷空调设备': 3, '专用设备': 2, '自动化设备': 2
    # },
    '机械设备': {
        '工程机械': 2, '轨交设备': 2, '通用设备': 2, '专用设备': 2, '自动化设备': 2
    },

    # '新能源-光伏': {
    #     '光伏电池组件': 3, '光伏辅材': 3, '光伏加工设备': 3, '硅料硅片': 3, '光伏发电': 3, '逆变器': 3
    # },
    '新能源-光伏': {
        '光伏设备': 2
    },
    # '新能源-风电': {
    #     '风电零部件': 3, '风电整机': 3, '风力发电': 3
    # },
    '新能源-风电': {
        '风电设备': 2
    },
    # '新能源-电池电机': {
    #     '电池化学品': 3, '锂电池': 3, '锂电专用设备': 3, '蓄电池及其他电池': 3, '电机': 2
    # },
    '新能源-电池电机': {
        '电池': 2, '电机': 2
    },
    '汽车': {
        '乘用车': 2, '汽车服务': 2, '汽车零部件': 2, '商用车': 2,
    },

    # '电网设备': {
    #     '电工仪器仪表': 3, '电网自动化设备': 3, '配电设备': 3, '输变电设备': 3, '线缆部件及其他': 3, '其他电源设备': 2
    # },
    '电网设备': {
        '电网设备': 2
    },

    # '通信': {
    #     '电信运营商': 3, '通信工程及服务': 3, '通信应用增值服务': 3, '其他通信设备': 3, '通信网络设备及器件': 3, '通信线缆及配套': 3,
    #     '通信终端及配件': 3
    # },
    '通信': {
        '通信服务': 2, '通信设备': 2
    },

    '生物医药': {
        '化学制药': 2, '生物制品': 2, '医疗器械': 2, '医药商业': 2, '中药': 2, '医疗服务': 2
    },

    # '食品饮料': {
    #     '白酒': 2, '非白酒': 2, '调味发酵品': 2, '食品加工': 2, '休闲食品': 2, '乳品': 3, '软饮料': 3
    # },
    '食品饮料': {
        '白酒': 2, '非白酒': 2, '调味发酵品': 2, '食品加工': 2, '休闲食品': 2, '饮料乳品': 2, '宠物食品': 3
    },
    '可选耐用品': {
        '纺织制造': 2, '服装家纺': 2, '饰品': 2, '文娱用品': 2, '摩托车及其他': 2
    },
    '可选非耐用品': {
        '个护用品': 2, '化妆品': 2, '医疗美容': 2, '教育': 2, '影视院线': 2, '游戏': 2, '酒店餐饮': 2, '旅游及景区': 2
    },
    '流通渠道': {
        '互联网电商': 2, '跨境免税': 2, '贸易': 2, '一般零售': 2
    },
    '交通运输': {
        '航空机场': 2, '航运港口': 2, '铁路公路': 2, '物流': 2
    },

    '公用事业': {
        '电力': 2, '燃气': 2, '环保设备': 2, '环境治理': 2
    }
}
